Tekla Open API Reference for Tekla Structures 2025
Detail.AutoDirectionType Property
 The auto direction type. Default value is AUTODIR_DETAIL. Value should be AUTODIR_NA to set direction with UpVector property. Value should be AUTODIR_FROM_ATTRIBUTE_FILE to set direction with detail attribute file.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AutoDirectionTypeEnum AutoDirectionType { get; set; }
Public Property AutoDirectionType As AutoDirectionTypeEnum
	Get
	Set
Property Value
Type: AutoDirectionTypeEnum
See Also
Reference
Detail Class
Tekla.Structures.Model Namespace